{
  "fragment": {
    "title": "Twiceme Technology — shaping a brands visual identity and strategy for the future",
    "desc": "Diving deep into stakeholders demands and user behaviour, a strategy for a personal safety company was created to increase user engagement and pave the way for the companys' product development.",
    "link": ""
  },
  "page": {
    "title": "Twiceme Technology — shaping a brands visual identity and strategy for the future",
    "desc": "Diving deep into stakeholders demands and user behaviour, a strategy for a personal safety company was created to increase user engagement and pave the way for the companys' product development.",
    "overview": "The twICEme app is a tool to use together with personal protective equipment enhanced with Twiceme’s NFC—technology to directly upload medical information to the equipment. If an accident occurs, the twICEme app can be used by first responders to scan the protective equipment in order to get medical information when the injured person cannot speak for themselves.\n\nThe redesign was based on data from three different user groups; common user, rescuers, and construction foremen. The data was used to create wireframes in a parallel design process. These wireframes was then made into hi—fi prototypes that was used in A/B—testing.",
    "duration": "6 months",
    "roles": [
      "UX & UI Design",
      "Design Systems",
      "Design Strategy",
      "Data—driven Personas",
      "Product Strategy"
    ],
    "insights": [
      {
        "title": "From a passive app to an active app",
        "desc": "Diving deep into stakeholders demands and user behaviour, a strategy for a personal safety company was created to increase user engagement and pave the way for the companys' product development. The app needed to turn into an active app, creating a higher value for the end—user. This was done by adding a way for end—users to register their products to the app, turning protiective equipment into collectibles."
      },
      {
        "title": "The implementation of feedback",
        "desc": "It's not a mystery that feedback is essential to a good user experience. But prior to the redesign the app did not give sufficient feedback to the user. Therefore, a mentatlity in the redesign was to \"never tell a user they've done something wrong, always guide them to do everything right\"."
      },
      {
        "title": "Color guidance",
        "desc": "Due to the app being in the context of personal safety, using the colors that convey a correct sense of urgency was important. This resulted in red never being using in input fields error state, etc. Instead, red was only used to guide the user to the emergency scan function within the app that needed to be accessed fast in case of an emergency.\n\nIf a user was not located at the home screen (where the emergency scan function was located) then the home navbar link was equipped with a red badge to grab the users attention at all times."
      }
    ]
  }
}
